Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_SwiftUI/project_save.tmx
Source language: en_us
Languages: ja

source: Create custom gestures from individual gestures using the simultaneously(with:), sequenced(before:), or exclusively(before:) modifiers, or combine gestures with keyboard modifiers using the modifiers(_:) modifier.
ja: あつらえのジェスチャを個々のジェスチャからsimultaneously(with:)、sequenced(before:)、またはexclusively(before:)修飾子を使って作成します、またはジェスチャとキーボード修飾子をmodifiers(_:)修飾子を使って結合します。

source: Create the view controller using your app's current data and contents of the context parameter.
ja: ビューコントローラをあなたのアプリのもつ現在のデータおよびcontextパラメータの内容を使って作成してください。

source: Create widgets to show your app’s content on the Home screen, with custom intents for user-customizable settings.
ja: あなたのアプリのもつ内容をホーム画面上で示すウィジェットを、ユーザのカスタマイズ可能な設定のためのあつらえのインテントで作成します。

source: Create your own custom views that conform to the View protocol, and compose them with SwiftUI views for displaying text, images, and custom shapes using stacks, lists, and more.
ja: Viewプロトコルに準拠するあなた独自のあつらえのビューを作成してください、そしてそれらを、スタック、リスト、その他いろいろを使用してテキスト、画像、そしてカスタム形状を表示するためにSwiftUIビューと構成してください。

source: Creates a Coordinator instance to coordinate with the NSView.
ja: あるCoordinatorインスタンスを作成して、NSViewと協調します。

source: Creates a Coordinator instance to coordinate with the UIView.
ja: あるCoordinatorインスタンスを作成して、UIViewと協調します。

source: Creates a Coordinator instance to coordinate with the UIViewController.
ja: あるCoordinatorインスタンスを作成して、UIViewControllerと協調します。

source: Creates a WatchKit interface object and configures its initial state.
ja: WatchKitインターフェイスオブジェクトを作成します、そしてそれの初期状態を構成設定します。

source: Creates a binding by projecting the base value to a hashable value.
ja: あるバインディングを、基本値をハッシュ可能値に対して投影することによって作成します。

source: Creates a binding by projecting the base value to an optional value.
ja: あるバインディングを、基本値をオプショナル値に対して投影することによって作成します。

source: Creates a binding by projecting the base value to an unwrapped value.
ja: あるバインディングを、基本値をあるアンラップされた値に対して投影することによって作成します、

source: Creates a binding to a hashable value.
ja: あるハッシュ可能値へのバインディングを作成します。

source: Creates a binding to an optional value.
ja: あるオプショナル値へのバインディングを作成します。

source: Creates a binding to an unwrapped value.
ja: あるアンラップされた値へのバインディングを作成します。

source: Creates a binding with a closure that reads from the binding value, and a closure that applies a transaction when writing to the binding value.
ja: あるバインディングを、そのバインディング値から読み出すクロージャ、そしてバインディング値へと書き込む時にトランザクションを適用するクロージャで作成します。

source: Creates a binding with an immutable value.
ja: バインディングを可変valueで作成します。

source: Creates a binding with closures that read and write the binding value.
ja: あるバインディングを、バインディング値を読み書きするクロージャで作成します。

source: Creates a bordered button style with a tint color.
ja: 境界線付きボタンスタイルをある淡色で作成します。

source: Creates a bordered button style.
ja: ある境界線付きボタンスタイルを作成します。

source: Creates a borderless button style.
ja: 境界線なしボタンスタイルを作成します。

source: Creates a button based on a configuration for a style with a custom appearance and custom interaction behavior.
ja: あるボタンを作成します、あつらえの外観とあつらえの相互作用挙動をもつスタイル用の構成設定に基づきます。

source: Creates a button that displays a custom label.
ja: あるボタンを作成します、それはあつらえのラベルを表示するものです。

source: Creates a button that generates its label from a localized string key.
ja: あるボタンを作成します、それはそれのラベルをあるローカライズ文字列キーから生成するものです。

source: Creates a button that generates its label from a string.
ja: あるボタンを作成します、それはそれのラベルをある文字列から生成するものです。

source: Creates a carousel list style.
ja: あるカルーセルリストスタイルを作成します。

source: Creates a color from an instance of NSColor.
ja: ある色をNSColorのインスタンスから作成します。

source: Creates a color from an instance of UIColor.
ja: ある色をUIColorのインスタンスから作成します。

source: Creates a color picker with a text label generated from a title string key.
ja: カラーピッカーをあるタイトル文字列キーから生成されたテキストラベルで作成します。

source: Creates a color picker with a text label generated from a title string.
ja: カラーピッカーをあるタイトル文字列から生成されたテキストラベルで作成します。

source: Creates a color stop with a color and location.
ja: 色経由を色と位置で作成します。

source: Creates a customizable Touch Bar view with a globally unique identifier.
ja: カスタマイズ可能なTouch Barビューをグローバルに特有な識別子で作成します。

source: Creates a default button style.
ja: 省略時のボタンスタイルを作成します。

source: Creates a default list style.
ja: ある省略時のリストスタイルを作成します。

source: Creates a default picker style.
ja: 省略時のピッカースタイルを作成します。

source: Creates a default toggle style.
ja: 省略時のトグルスタイルを作成します。

source: Creates a disclosure group with the given label and content views, and a binding to the expansion state (expanded or collapsed).
ja: 開示グループをこの与えられたラベルとコンテンツビューで作成します、そしてバインディングを展開状態（展開されたまたは折りたたまれた）に対して作成します。

source: Creates a disclosure group with the given label and content views.
ja: 開示グループをこの与えられたラベルとコンテンツビューで作成します。

source: Creates a disclosure group, using a provided localized string key to create a text view for the label, and a binding to the expansion state (expanded or collapsed).
ja: 開示グループを作成します、提供されたローカライズされた文字列キーを使ってテキストビューをラベルに対して、そしてバインディングを展開状態（展開されたまたは折りたたまれた）に対して作成します。

source: Creates a disclosure group, using a provided localized string key to create a text view for the label.
ja: 開示グループを作成します、提供されたローカライズされた文字列キーを使ってテキストビューをラベルに対して作成します。

source: Creates a disclosure group, using a provided string to create a text view for the label, and a binding to the expansion state (expanded or collapsed).
ja: 開示グループを作成します、提供された文字列を使ってテキストビューをラベルに対して、そしてバインディングを展開状態（展開されたまたは折りたたまれた）に対して作成します。

source: Creates a disclosure group, using a provided string to create a text view for the label.
ja: 開示グループを作成します、提供された文字列を使ってテキストビューをラベルに対して作成します。

source: Creates a document group that is able to create and edit reference file documents.
ja: リファレンスファイル書類を作成および編集できる書類グループを作成します。

source: Creates a document group that is able to view reference file documents.
ja: リファレンスファイル書類を視聴できる書類グループを作成します。

source: Creates a dragging gesture with the minimum dragging distance before the gesture succeeds and the coordinate space of the gesture’s location.
ja: あるドラッグジェスチャを、ジェスチャが成功するまでの最小限のドラッグ間隔およびジェスチャのもつ位置の座標空間で作成します。

source: Creates a gesture from two gestures where only one of them succeeds.
ja: あるジェスチャを２つのジェスチャから作成します、そこではそれらのただ１つだけが成功します。

source: Creates a gesture state with a reset transaction.
ja: ジェスチャ状態をリセットトランザクションで作成します。

source: Creates a gesture state with the initial state value and a reset transaction.
ja: ジェスチャ状態を初期状態値とリセットトランザクションで作成します。

source: Creates a gesture state with the initial state value.
ja: ジェスチャ状態を初期状態値で作成します。

source: Creates a gesture with two gestures that can receive updates or succeed independently of each other.
ja: あるジェスチャを２つのジェスチャで作成します、それらは更新または成功を別々に受け取ることができます。

source: Creates a gradient from an array of color stops.
ja: 色経由それらからなるある配列から勾配を作成します。

source: Creates a gradient from an array of colors.
ja: 色の配列から勾配を作成します。

source: Creates a grouped list style.
ja: グループにされたリストのスタイルを作成します。

source: Creates a hosting controller object from an archive and the specified SwiftUI view.
ja: ホスティングコントローラオブジェクトをあるアーカイブおよび指定されたSwiftUIビューから作成します。

source: Creates a hosting controller object from the contents of the specified archive.
ja: ホスティングコントローラオブジェクトをこの指定されたアーカイブの内容から作成します。

source: Creates a hosting controller object from the contents of the specified nib file.
ja: ホスティングコントローラオブジェクトをこの指定されたnibファイルの内容から作成します。

source: Creates a hosting controller object that wraps the specified SwiftUI view.
ja: 指定されたSwiftUIビューをラップするホスティングコントローラオブジェクトを作成します。

source: Creates a hosting controller object that you can use to implement your app's main interface using SwiftUI views
ja: あるホスティングコントローラオブジェクトを作成します、それは、あなたがあなたのアプリのもつメインインターフェイスをSwiftUIビューを使って実装するために使用できるものです。

source: Creates a hosting view object from the contents of the specified archive.
ja: ホスティングビューオブジェクトをこの指定されたアーカイブの内容から作成します。

source: Creates a hosting view object that wraps the specified SwiftUI view.
ja: あるホスティングビューオブジェクトを作成します、それは指定されたSwiftUIビューをラップします。

source: Creates a labeled image that you can use as content for controls, with the specified label.
ja: あなたがコントロールの内容として使用できるラベル付き画像を、この指定されたラベルで作成します。

source: Creates a labeled image that you can use as content for controls.
ja: あなたがコントロールに対する内容として使用できるラベル付き画像を作成します。

source: Creates a link button style.
ja: リンクボタンスタイルを作成します。

source: Creates a list that computes its rows on demand from an underlying collection of identifiable data.
ja: あるリストを作成します、それはそれの行それらを、身元識別可能データからなるある基礎をなすコレクションから請求に応じて計算するものです。

source: Creates a list that computes its views on demand over a constant range.
ja: あるリストを作成します、それは、それのビューそれらを必要に応じてある定数範囲にわたって計算するものです。

source: Creates a list that identifies its rows based on a key path to the identifier of the underlying data.
ja: あるリストを作成します、それは、それの行それらを、基礎をなすデータの識別子へのあるキーパスに基づいて識別するものです。

source: Creates a list with the given content that supports selecting a single row.
ja: あるリストをその与えられた内容で作成します、それは単一の行の選択をサポートします。

source: Creates a list with the given content that supports selecting multiple rows.
ja: あるリストをその与えられた内容で作成します、それは複数の行の選択をサポートします。

source: Creates a list with the given content.
ja: あるリストをこの与えられた内容で作成します。

source: Creates a long-press gesture with a minimum duration and a maximum distance that the interaction can move before the gesture fails.
ja: ある長押しゼスチャをある最小期間と、ジェスチャが失敗する前にその相互作用が動ける最大間隔で作成します。

source: Creates a magnification gesture with a given minimum delta for the gesture to start.
ja: ある拡大ゼスチャをそのゼスチャを開始するためのある与えられた最小デルタで作成します。

source: Creates a named color.
ja: ある名前付きの色を作成します。

source: Creates a new Binding focused on Subject using a key path.
ja: Subject上にフォーカスされる新しい Bindingを、あるキーパスを使って作成します。

source: Creates a new fill style with the specified settings.
ja: 新しいフィルスタイルをこの指定された設定で作成します。

source: Creates a new gesture that’s the result of an ongoing gesture.
ja: ある新しいジェスチャを作成します、それは進行中のジェスチャの結果です。

source: Creates a new instance that’s scrollable in the direction of the given axis and can show indicators while scrolling.
ja: 新しいインスタンスを作成します、それは与えられた軸の方向においてスクロール可能であるそしてスクロールしている間にインジケータを示せるものです。

source: Creates a new locale key.
ja: 新しいロケールキーを作成します。

source: Creates a new set from a finite sequence of items.
ja: いくつかの要素からなる有限のシーケンスから集合を作成します。

source: Creates a new set from a raw value.
ja: 生の値から新しい集合を作成します。

source: Creates a non-customizable Touch Bar view.
ja: カスタマイズ不可のタッチバービューを作成します。

source: Creates a notification hosting controller object that you can use to implement your notification interfaces using SwiftUI views.
ja: ある通知ホスティングコントローラオブジェクトを作成します、それは、あなたがあなたの通知インターフェイスをSwiftUIビューを使って実装するために使用できるものです。

source: Creates a path as an ellipse inscribed within the given rectangle.
ja: あるパスをその与えられた矩形内に内接する楕円として作成します。

source: Creates a path as the given rectangle.
ja: あるパスをその与えられた矩形として作成します。

source: Creates a path as the given rounded rectangle.
ja: あるパスをその与えられた角丸矩形として作成します。

source: Creates a path from a copy of a mutable shape path.
ja: 可変形状パスのコピーからあるパスを作成します。

source: Creates a path from an immutable shape path.
ja: 不変形状パスからあるパスを作成します。

source: Creates a plain button style.
ja: 素のボタンスタイルを作成します。

source: Creates a plain list style.
ja: あるプレーンなリストスタイルを作成します。

source: Creates a property that can read and write to an integer user default, transforming that to RawRepresentable data type.
ja: あるプロパティを作成します、それはある整数defaultを読み出しおよび書き出しが可能です、それをRawRepresentableデータ型に変換しています。

source: Creates a rotation gesture with a minimum delta for the gesture to start.
ja: 回転ジェスチャをそのジェスチャを開始するためのある最小デルタで作成します。

source: Creates a sequence gesture with two gestures.
ja: ある連続ジェスチャを２つのジェスチャで作成します。

source: Creates a set containing the elements of the given array literal.
ja: 与えられた配列リテラルの要素を含んでいる集合を作成します。

source: Creates a side by side button alert.
ja: 横並びボタン警報を作成します。

source: Creates a sidebar list style.
ja: あるサイドバーリストスタイルを作成します。

source: Creates a state without an initial value.
ja: 状態を初期値なしで作成します。

source: Creates a tap gesture with the number of required taps.
ja: あるタップゼスチャをこの必要とされるタップ数で作成します。

source: Creates a text view that displays a stored string without localization.
ja: あるテキストビューを作成します、それは、ある格納された文字列をローカライゼーションなしに表示するものです。

source: Creates a text view that displays a string literal without localization.
ja: あるテキストビューを作成します、それは、ある文字列リテラルをローカライゼーションなしに表示するものです。

source: Creates a text view that displays localized content identified by a key.
ja: あるテキストビューを作成します、それは、キーによって識別されるローカライズされた内容を表示するものです。

source: Creates a transaction and assigns its animation property.
ja: あるトランザクションを作成します、そしてそれのアニメーションプロパティを割り当てます。

source: Creates a transaction.
ja: トランザクションを作成します。

source: Creates a view state that’s derived from a gesture with a closure that provides a transaction to reset it.
ja: あるビュー状態を作成します、それは、それをリセットするトランザクションを提供するクロージャをもつジェスチャから引き出されるものです。

source: Creates a view state that’s derived from a gesture with a transaction to reset it.
ja: あるビュー状態を作成します、それは、それをリセットするトランザクションをもつジェスチャから引き出されるものです。

source: Creates a view state that’s derived from a gesture with a wrapped state value and a closure that provides a transaction to reset it.
ja: あるビュー状態を作成します、それは、ラップされた状態値およびそれをリセットするトランザクションを提供するクロージャをもつジェスチャから引き出されるものです。

source: Creates a view state that’s derived from a gesture with a wrapped state value and a transaction to reset it.
ja: あるビュー状態を作成します、それは、ラップされた状態値およびそれをリセットするトランザクションをもつジェスチャから引き出されるものです。

source: Creates a view state that’s derived from a gesture with an initial state value and a closure that provides a transaction to reset it.
ja: あるビュー状態を作成します、それは、初期値およびそれをリセットするトランザクションを提供するクロージャをもつジェスチャから引き出されるものです。

source: Creates a view state that’s derived from a gesture with an initial state value and a transaction to reset it.
ja: あるビュー状態を作成します、それは、初期値およびそれをリセットするトランザクションをもつあるジェスチャから引き出されるものです。

source: Creates a view state that’s derived from a gesture with an initial value.
ja: あるビュー状態を作成します、それは、初期値をもつジェスチャから引き出されるものです。

source: Creates a view state that’s derived from a gesture.
ja: あるビュー状態を作成します、それは、あるジェスチャから引き出されるものです。

source: Creates a view that represents the body of a button.
ja: ボタンのボディを表すビューを作成します。

source: Creates a view that represents the body of a toggle.
ja: あるビューを作成します、それはトグルの本体を表すものです。

source: Creates an action sheet with the provided buttons.
ja: アクションシートをこの提供されたボタンで作成します。

source: Creates an alert with two buttons.
ja: ２つのボタンをもつ警報を作成します。

source: Creates an animated pair with the provided values.
ja: アニメーション化されたペアをこの提供された値それらで作成します。

source: Creates an empty option set.
ja: 空のオプションセットを作成します。

source: Creates an empty path, and then executes the closure to add the initial elements.
ja: 空のパスを作成します、そしてそれからクロージャを遂行して初期要素それらを加えます。

source: Creates an empty path.
ja: 空のパスを作成します。

source: Creates an environment object.
ja: ある環境オブジェクトを作成します。

source: Creates an environment property to read the specified key path.
ja: 環境プロパティを作成してその指定されたキーパスを読み出します。

source: Creates an environment values instance.
ja: 環境値インスタンスを作成します。

source: Creates an instance configured to increment and decrement value by units of step and clamped to bounds.
ja: valueを漸増および漸減するよう構成設定されたインスタンスを作成します、stepの単位によってそしてboundsに留め置いて。

source: Creates an instance configured to increment and decrement value by units of step.
ja: valueを漸増および漸減するよう構成設定されたインスタンスを作成します、stepの単位によって。

source: Creates an instance containing just e
ja: ただeだけを含んでいるインスタンスを作成します。

source: Creates an instance from another gesture.
ja: あるインスタンスを他のジェスチャから作成します。

source: Creates an instance from two child gestures.
ja: あるインスタンスを２つの子ジェスチャから作成します。

source: Creates an instance initialized to the given value.
ja: 与えられた値に初期化されるインスタンスを作成します。

source: Creates an instance representing a value within a range.
ja: ある値をある範囲内で表しているあるインスタンスを作成します。

source: Creates an instance that computes views on demand over a given constant range.
ja: あるインスタンスを作成します、それは、ビューそれらを必要に応じてある与えられた定数範囲にわたって計算するものです。

source: Creates an instance that displays state based on isOn.
ja: isOnに基づいて状態を表示するあるインスタンスを作成します。

source: Creates an instance that selects a Date in a closed range.
ja: あるインスタンスを作成します、それはある完結範囲の中のあるDateを選択します。

source: Creates an instance that selects a Date on or after some start date.
ja: あるインスタンスを作成します、それは何らかの開始日上のまたはより後のあるDateを選択します。

source: Creates an instance that selects a Date on or before some end date.
ja: あるインスタンスを作成します、それは何らかの終了日上のまたはより前のあるDateを選択します。

source: Creates an instance that selects a Date with an unbounded range.
ja: あるインスタンスを作成します、それはある無制限範囲でのあるDateを選択します。

source: Creates an instance that selects a Date within the given range.
ja: あるインスタンスを作成します、それは与えられた範囲でのあるDateを選択します。

source: Creates an instance that selects a color.
ja: あるインスタンスを作成します、それはある色を選択するものです。

source: Creates an instance that selects from content associated with Selection values.
ja: あるインスタンスを作成します、それはSelection値それらと結びつけられた内容から選択するものです。

source: Creates an instance that uniquely identifies and creates views across updates based on the identity of the underlying data.
ja: あるインスタンスを作成します、それは、ビューそれらを更新を越えてその基礎をなすデータの同一性に基づいて特有に識別および作成するものです。

source: Creates an instance that uniquely identifies and creates views across updates based on the provided key path to the underlying data’s identifier.
ja: あるインスタンスを作成します、それは、ビューそれらを更新を越えてその基礎をなすデータのもつ識別子へのこの提供されたキーパスに基づいて特有に識別および作成するものです。

source: Creates an instance with the given alignment.
ja: あるインスタンスをこの与えられた整列で作成します。

source: Creates an instance with the given horizontal and vertical alignments.
ja: あるインスタンスをこの与えられた水平および垂直整列で作成します。

source: Creates an instance with the given identifier.
ja: あるインスタンスをこの与えられた識別子で作成します。

source: Creates an instance with the given spacing and horizontal alignment.
ja: あるインスタンスをこの与えられた空きと水平整列で作成します。

source: Creates an instance with the given spacing and vertical alignment.
ja: あるインスタンスをこの与えられた空きと垂直整列で作成します。

source: Creates an instance.
ja: １つのインスタンスを作成します。

source: Creates an object to coordinate with the AppKit view controller.
ja: あるオブジェクトを作成して、AppKitビューコントローラと協調します。

source: Creates an object to coordinate with the WatchKit interface object.
ja: あるオブジェクトを作成してWatchKitインターフェイスオブジェクトと協調します。

source: Creates an observed object with an initial value.
ja: 監視されるオブジェクトをある初期値で作成します。

source: Creates an observed object with an initial wrapped value.
ja: 監視されるオブジェクトをある初期ラップ値で作成します。

source: Creates an unlabeled, decorative image.
ja: ラベル無しの、装飾的な画像を作成します。

source: Creates and launches a task with a specified executable and arguments.
ja: あるタスクをある指定された実行形式ファイルと引数で作成して起動します。

source: Creates the custom instance that you use to communicate changes from your interface object to other parts of your SwiftUI interface.
ja: あつらえのインスタンスを作成します、それはあなたが使用して、変更をあなたのインターフェイスオブジェクトからあなたのSwiftUIインターフェイスの他の部分へと伝達するものです。

source: Creates the custom instance that you use to communicate changes from your view controller to other parts of your SwiftUI interface.
ja: あつらえのインスタンスを作成します、それはあなたが使用して、変更をあなたのビューコントローラからあなたのSwiftUIインターフェイスの他の部分へと伝達するものです。

source: Creates the custom instance that you use to communicate changes from your view to other parts of your SwiftUI interface.
ja: あつらえのインスタンスを作成します、それはあなたが使用して、変更をあなたのビューからあなたのSwiftUIインターフェイスの他の部分へと伝達するものです。

source: Creates the custom object that you use to communicate changes from your view controller to other parts of your SwiftUI interface.
ja: あつらえのオブジェクトを作成します、それはあなたが使用して、変更をあなたのビューコントローラからあなたのSwiftUIインターフェイスの他の部分へと伝達するものです。

source: Creates the state with an initial value.
ja: 状態をある初期値で作成します。

source: Creates the state with an initial wrapped value.
ja: 状態をあるラップされた初期値で作成します。

source: Creates the view controller object and configures its initial state.
ja: ビューコントローラオブジェクトを作成します、そしてそれの初期状態を構成設定します。

source: Creates the view object and configures its initial state.
ja: ビューオブジェクトを作成します、そしてそれの初期状態を構成設定します。

source: Creating Accessible Views
ja: アクセシブルビューを作成する

source: Creating a Binding
ja: バインディングを作成する

source: Creating a Bordered Button Style
ja: 境界線付きボタンスタイルを作成する

source: Creating a Borderless Button Style
ja: 境界線なしボタンスタイルを作成する

source: Creating a Button
ja: ボタンを作成する

source: Creating a Capsule
ja: カプセルを作成する

source: Creating a Carousel List Style
ja: カルーセル（回転式）リストスタイルを作成する

source: Creating a Circle
ja: 円を作成する

source: Creating a Collection of Views
ja: ビューいくつかからなるコレクションを作成する

source: Creating a Color
ja: 色を作成する

source: Creating a Color Picker
ja: カラーピッカーを作成する

source: Creating a Command Group
ja: コマンドグループを作成する

source: Creating a Context Menu
ja: コンテキストメニューを作成する

source: Creating a Custom Alignment
ja: あつらえの整列を作成する

source: Creating a Date Picker
ja: 日付ピッカーを作成する

source: Creating a Default Button Style
ja: 省略時のボタンスタイルを作成する

source: Creating a Default List Style
ja: 省略時のリストスタイルを作成する

source: Creating a Default Toggle Style
ja: 省略時のトグルスタイルを作成する

source: Creating a Disclosure Group with a Custom Label View
ja: 開示グループをあつらえのラベルビューで作成する

source: Creating a Disclosure Group with a String Label
ja: 開示グループを文字列ラベルで作成する

source: Creating a Divider
ja: 仕切りを作成する

source: Creating a Drag Gesture
ja: ドラッグジェスチャを作成する

source: Creating a Drop Proposal
ja: ドロップ申し込みを作成する

source: Creating a Fetch Request
ja: フェッチリクエストを作成する

source: Creating a Form
ja: フォームを作成する

source: Creating a Gauge
ja: ゲージを作成する

source: Creating a Geometry Reader
ja: ジオメトリリーダー（形状読取機）を作成する

source: Creating a Gesture State
ja: ジェスチャ状態を作成する

source: Creating a Group
ja: グループを作成する

source: Creating a Group Box
ja: グループボックスを作成する

source: Creating a Grouped List Style
ja: グループにされたリストのスタイルを作成する

source: Creating a Horizontal Split View
ja: 水平スプリットビューを作成する

source: Creating a Hosting Controller Object
ja: ホスティングコントローラオブジェクトを作成する

source: Creating a Hosting View
ja: ホスティングビューを作成する

source: Creating a Linear Gradient
ja: 線形勾配を作成する

source: Creating a Link Button Style
ja: リンクボタンスタイルを作成する

source: Creating a List
ja: リストを作成する

source: Creating a Long-Press Gesture
ja: 長押しゼスチャを作成する

source: Creating a Magnification Gesture
ja: 拡大ゼスチャを作成する

source: Creating a Menu Button
ja: メニューボタンを作成する

source: Creating a Modified Content View
ja: 修正されたコンテンツビューを作成する

source: Creating a Navigation Link
ja: ナビゲーション（誘導）リンクを作成する

source: Creating a Navigation View
ja: ナビゲーション（誘導）ビューを作成する

source: Creating a Paste Button
ja: ペースト（貼り付け）ボタンを作成する

source: Creating a Path
ja: パスを作成する

source: Creating a Picker
ja: ピッカー（選び出し集）を作成する

source: Creating a Plain Button Style
ja: プレーン（素の）ボタンスタイルを作成する

source: Creating a Plain List Style
ja: プレーン（素の）リストスタイルを作成する

source: Creating a Preview Device
ja: プレビューデバイスを作成する

source: Creating a Radial Gradient
ja: 円形勾配（グラデーション）を作成する

source: Creating a Rectangle
ja: 矩形を作成する

source: Creating a Reference File Document Group
ja: リファレンスファイル書類グループを作成する

source: Creating a Rotated Shape
ja: 回転形状を作成する

source: Creating a Rotation Gesture
ja: 回転ジェスチャを作成する

source: Creating a Rounded Rectangle
ja: 角丸矩形を作成する

source: Creating a Scaled Shape
ja: 縮尺された形状を作成する

source: Creating a Scanner
ja: スキャナーを作成する

source: Creating a Scroll View
ja: スクロールビューを作成する

source: Creating a Section
ja: セクションを作成する

source: Creating a Secure Field View
ja: セキュアフィールドビューを作成する

source: Creating a Sequence Gesture
ja: 連続ジェスチャを作成する

source: Creating a Sidebar List Style
ja: スライダーリストスタイルを作成する

source: Creating a Simultaneous Gesture
ja: ある同時のジェスチャを作成する

source: Creating a Slider
ja: スライダーを作成する

source: Creating a Spacer
ja: スペーサーを作成する

source: Creating a Stack
ja: スタックを作成する

source: Creating a State
ja: 状態を作成する

source: Creating a Stepper
ja: ステッパーを作成する

source: Creating a Subscription View
ja: サブスクリプションビューを作成する

source: Creating a Tab View
ja: タブビューを作成する

source: Creating a Tap Gesture
ja: タップゼスチャを作成する

source: Creating a Text View
ja: テキストビューを作成する

source: Creating a TextField View
ja: TextFieldビューを作成する

source: Creating a Toggle
ja: トグルを作成する

source: Creating a Touch Bar View
ja: Touch Barビューを作成する

source: Creating a Transaction
ja: トランザクションを作成する

source: Creating a Transformed Shape
ja: 変形された形状を作成する

source: Creating a Tuple View
ja: タプルビューを作成する

source: Creating a Vertical Split View
ja: 垂直分割ビューを作成する

source: Creating a View
ja: ビューを作成する

source: Creating a Widget Extension
ja: ウィジェット拡張を作成する

source: Creating a watchOS App
ja: watchOSアプリを作成する

source: Creating an Action Sheet
ja: アクションシートを作成する
